import pandas as ch

print('----'*30)
print('Сведения о школьниках')

children_id = {
        'ID': ['01','02','03','04','05'],
        'Имя' : ['Анна','Андрей','Владимир','Марина','Елена', 'Антон', 'Татьяна'],
        'Фамилия': ['Самойлова','Борисов','Липин','Белова','Кудрявцева', 'Марьин', 'Фролова'],
        'Дата рождения' : ['15.04.2011','12.11.2012','05.07.2011','22.04.2012','14.05.2011', '02.03.2011', '17.10.2012'],
        'Успеваемость' : ['хорошо','хорошо','отлично','удовлетворительно','удовлетворительно', 'отлично', 'хорошо']
}
    
child = ch.DataFrame(data = children_id)

with open('children.csv', 'a', encoding='UTF-8') as chil:
        chil.write(f'{child}')
        chil.write('\n')
    
print(child)