import pandas as ch

print('----'*12)
print('Информация о классах')

class_id = {
        'Предмет': ['Русский язык','Химия','Физика','Биология','Информатика','Литература','История'],
        'Номер класса' : ['1','2','3','4','5','6','7'],
        'Ряды в классе': ['первый ряд','второй ряд','третий ряд','четвертый ряд','пятый ряд','шестой ряд','седьмой ряд'],
        'ID' : ['01','02','03','04','05','06','07']
}
    
c = ch.DataFrame(data = class_id)

with open('cabinet.csv', 'a', encoding='UTF-8') as cl:
        cl.write(f'{c}')
        cl.write('\n')
    
print(c)